package org.example.course_2_Objects_Constructors.HomeWork;
/**
 Создай класс BankAccount, который будет моделировать банковский счет с
 инкапсулированными полями и методами для работы с ними.

 Требования:
 Поля:

 private String accountNumber – номер счета (задается при создании объекта).
 private double balance – баланс счета (по умолчанию 0.0).
 Конструктор:

 Принимает номер счета и начальный баланс (если баланс меньше 0, устанавливается 0).
 Методы (аксессоры и мьютейтеры или геттеры и сеттеры):

 getAccountNumber() – возвращает номер счета.
 getBalance() – возвращает текущий баланс.
 deposit(double amount) – метод для пополнения счета (если сумма > 0, добавляет к балансу).
 withdraw(double amount) – метод для снятия денег (если сумма > 0 и баланс позволяет, уменьшает баланс).
 В main создайте несколько объектов BankAccount, выполните пополнение и снятие средств, проверьте ограничения.



 */
public class Program {
}
